[{"name":"John","comment":"We surely intend to visit Little Palm Island again. It is our \"favorite place\" to vacation. We leave for Europe this afternoon and I almost wish we were driving South again rather than flying East!"},{"name":"Jim and Sharon","comment":"My husband and I just returned from Little Palm Island. This was not our first visit to the island, and I can say that the service was even better on this trip ( & we thought it would be hard to improve). The rooms are wonderful and tropically decorated. The outside bamboo shower is the best. Employees were so nice and friendly. It is our favorite place to go relax and actually do nothing for five days! Our favorite activity is just laying by the pool and dining on the wonderful food in the most beautiful setting you could imagine. We were definitely spoiled by the time we left. We can't wait to return next year for our 8th anniversary!"},{"name":"Gary and Pauline","comment":"On behalf of my husband, Gary and myself, I would like to thank you for a memorable stay at Little Palm Island, we had a romantic and relaxing time. The setting is beautiful, the attention to detail is fantastic, the staff are exceptional and the food is exquisite. We have lived in the US for two years and traveled extensively and were delighted to finally find a quality resort, we were starting to think they never existed. We appreciate the logistical problems that you encounter being on an island in terms of supplies and staff yet are able to achieve exceedingly high standards."},{"name":"Leslie","comment":"Of all your resorts, I love this one the best! If the man of my dreams, one day, ever bends down on one knee to propose marriage, I will say \"yes!\" and want to marry at your resort, that feels like the one of my dreams. Thank you for your existence. I am happy dreaming and if dreams come true, I will cry, but happily! Thank you for creating the absolutely best resort. I could not have written one any better."},{"name":"Allan and Marcie","comment":"We stayed a Little Palm at the end of February for our anniversary, and we had an incredible time. The experience lived up to it's reputation, the staff was so friendly and the service they provided was out of this world. We also loved the dining experience right at the water's edge, the food was excellent. I am used to wearing my cell phone all the times, and it was so relaxing to finally be able to turn it off and enjoy my wife. All in all the perfect anniversary, we will be back."},{"name":"Mike and Sherrie","comment":"Dear Erica: I just wanted to say thanks again for all your help setting up this surprise for my wife. We had the greatest vacation and anniversary thanks to all your help. It was great to meet you and thank you in person. We will never forget this vacation and the great time we had on Little Palm Island. We also hope to get back to see you guys someday soon."},{"name":"Amy and Rob","comment":"My recent stay at your excellent resort was superb in every way. The entire staff was outstanding. We were rejuvenated instantly... the cuisine, the accomodations and those great outdoor showers. Thanks to all!!! See you very soon."},{"name":"Susan","comment":"We had a wonderful stay at Little Palm. Often I will go on your web site and just sigh. It is very captivating and helped to encourage me to make reservations for my husband's retirement vacation. What a wonderful place. Thanks."},{"name":"Jennifer","comment":"We recently visited Little Palm Island and found the island to be just lovely in every way. I wanted to make a special notation of the wonderful service we received from Rolando. Nothing was beneath him and he exceeded our service expectations. Lastly, the accommodations and housekeeping was superb. The concierge was extremely helpful and pleasant. I'm a meeting planner and I work with a ton of hotels and I thought your staff was one of the best I've experienced. Thank you kindly."},{"name":"Daniel","comment":"Thank You all so much for giving us a wonderful tenth anniversary. I got a bunch of \"good husband\" points from my wife, enough I hope to last another ten years. Regards."},{"name":"Russell","comment":"I had to write and tell you what a fantastic time I had at Little Palm Island. Everyone was terrific!The food was excellent and the ambiance that you set was amazing! Everyone on the Island, from the concierge, to the \"beach guys\" to the quarterdeck and other in the dining room, made the experience very special. I took my wife there to celebrate her 50th birthday. All of you made our trip a very special experience.Thank You again."},{"name":"Antoinette","comment":"Thanks for a terrific experience!"},{"name":"Monty & Sally","comment":"Dear Mr. Gardinier: My travels have been many and I am familiar with fine quality properties.This is the first time I have written a letter of praise for so many members of a property staff.We checked in to Little Palm Island, to celebrate a birthday. We welcomed at the shore station and I was instantly impressed that the staff not only knew our names, yet wished my guest a Happy Birthday weekend. Their warm greeting and smiles created immediate relaxation and their efficiency was first-rate.The staff at the pool bar is also deserving of a special nod. They were polite, remembered our drinks, made suggestions and place orders according to our request.The dining room staff followed through with my requested for my wife's birthday without incident.Last yet certainly not least, a HUGE thanks and a word of praise to our personal escape planner, in reservations. I first spoke with her months before we check-in, and right up to the day of our arrival she was a joy to work with. She answered all my questions with knowledge and efficiency. Every detail was followed up, and every request was taken care of. She even took the time to introduce herself and say hello when we arrive at the Welcome Station.   Emmanuel, I commend you on your beautiful property and your staff.  Many many thanks."},{"name":"Reinaldo & Mirta","comment":"To all the employees, Thank you for making our stay so pleasant. See you soon."},{"name":"William","comment":"We wanted to say thank you for one of the best vacation experiences we've ever had. Little Palm Island is such a wonderful retreat, and we've been talking about it ever since our stay there. We will certainly recommend it to our friends and we will no doubt plan another get away to Little Palm Island in the future. Please extend our gratitude to your entire staff. Everyone was so nice and accommodating. We really appreciate everything you did fir the two of us. Sincerely."},{"name":"Bob","comment":"My wife and I just returned from a terrific vacation at Little Palm Island. Everything & everyday was superb. Again thanks & I hope to see you soon."},{"name":"Pamela & Alfred","comment":"Dear Mr. Gardinier and staff, I can't begin to thank you enough for the generous hospitality we received during our stay at Little Palm Island. My husband and I were there to celebrate our anniversary and it was truly magical. Forever I will have fond memories of a romantic getaway sprinkled with rose petals, champagne, the deer, amazing food, and spectacular sun sets. I am telling all my friends about what a jewel you have down the Keys. We hope to be back again some day soon. Very Best wishes."},{"name":"Shari","comment":"Great place! It made our anniversary special. I would return in a heartbeat.  Thank you!"},{"name":"Joseph & Ana","comment":"This place is heaven and paradise all wrap up in one great location, and the staff is the best staff I have seen in my 30 years of traveling."},{"name":"Steve","comment":"We love everything about this wonderful resort. We look forward to a peaceful and beautiful stay, and we are always pleased. The staff, location and food are great."},{"name":"David","comment":"This was a very relaxing vacation; your place is beautiful. Thank You."},{"name":"Walter","comment":"Wonderful, wonderful, wonderful. Food was as spectacular as the facilities."},{"name":"John","comment":"Absolutely fantastic, food beyond superb. Staff wonderful."},{"name":"Rita","comment":"This was the most relaxing getaway we ever had.  We are most definitely coming back."},{"name":"Maria","comment":"Hotel is fabulous and relaxing you really get lost!! Our compliments to the management Team."},{"name":"e11","comment":"e11"},{"name":"guuuu","comment":"guu"},{"name":"asdccc","comment":"ccc"},{"name":"qwe","comment":"qwe123"},{"name":"bender","comment":"I built my own hotel with blackjack."},{"name":"zxc","comment":"zxczxc"}]